In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "user_id":[1,2],
    "name": ["aLicE","BOB"]
})

In [3]:
df

   user_id   name
0        1  aLicE
1        2    BOB

In [4]:
df["name"] = df.name.str.capitalize()

In [5]:
df

   user_id   name
0        1  Alice
1        2    Bob

### find users with valid emails

In [6]:
df2 = pd.DataFrame({
    'user_id': [1, 2, 3, 4, 5, 6, 7],
      'name': ['Winston', 'Jonathan', 'Annabelle', 'Sally', 'Marwan', 'David', 'Shapiro'],
      'mail': [
          'winston@leetcode.com',
          'jonathanisgreat',
          'bella-@leetcode.com',
          'sally.come@leetcode.com',
          'quarz#2020@leetcode.com',
          'david69@gmail.com',
          '.shapo@leetcode.com'
      ]
})

In [7]:
df2

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
1        2   Jonathan          jonathanisgreat
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com
4        5     Marwan  quarz#2020@leetcode.com
5        6      David        david69@gmail.com
6        7    Shapiro      .shapo@leetcode.com

In [8]:
regex_pattern = r'^[a-zA-Z][a-zA-Z0-9._-]*@leetcode[.]com$'

In [9]:
df2[df2.mail.str.match(regex_pattern)]

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

### patients with condition

In [10]:
df3 = pd.DataFrame({
    'patient_id': [1, 2, 3, 4, 5],
      'patient_name': ['Daniel', 'Alice', 'Bob', 'George', 'Alain'],
      'conditions': [
          'YFEV COUGH',
          '',  # Represents the empty string condition for Alice
          'DIAB100 MYOP',
          'ACNE DIAB100',
          'DIAB201'
      ]
})

In [11]:
df3

   patient_id patient_name    conditions
0           1       Daniel    YFEV COUGH
1           2        Alice
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100
4           5        Alain       DIAB201

In [12]:
pattern = r'^DIAB1| DIAB1'

In [13]:
df3[df3.conditions.str.contains(pattern)]

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

### Delete Duplicate Emails

In [14]:
df4 = pd.DataFrame({
    "id":[1,2,3],
    "email": ["john@example.com","bob@example.com","john@example.com"]
})

In [15]:
df4

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [16]:
df4.email.duplicated()

0    False
1    False
2     True
Name: email, dtype: bool

In [17]:
df4.drop_duplicates(subset=['email'],keep='first',inplace=True)

In [18]:
df4.columns

Index(['id', 'email'], dtype='object')

In [19]:
df4

   id             email
0   1  john@example.com
1   2   bob@example.com

In [20]:
# person.sort_values(by="id",inplace=True)
# person.drop_duplicates(subset=["email"],keep="first",inplace=True)

### Rearrange products table

In [21]:
import numpy

In [22]:
product_table = pd.DataFrame({
    "product_id":[0,1],
    "store1":[95,70],
    "store2":[100,numpy.nan],
    "store3":[105,80],

})

In [23]:
product_table

   product_id  store1  store2  store3
0           0      95   100.0     105
1           1      70     NaN      80

In [24]:
pt = pd.melt(product_table,id_vars="product_id",value_vars=["store1","store2","store3"],var_name="store",
        value_name="price").sort_values(by="product_id")

In [25]:
pt

   product_id   store  price
0           0  store1   95.0
2           0  store2  100.0
4           0  store3  105.0
1           1  store1   70.0
3           1  store2    NaN
5           1  store3   80.0

In [26]:
pt.columns

Index(['product_id', 'store', 'price'], dtype='object')

In [28]:
pt.dropna(subset="price",inplace=True)

In [29]:
pt

   product_id   store  price
0           0  store1   95.0
2           0  store2  100.0
4           0  store3  105.0
1           1  store1   70.0
5           1  store3   80.0